bin/Debug/Resources/Log/ReplicaStock_14052026_155850.log

[14/05/2026 | 15:58:50 ] [INFO] Se encontraron 8 registros en ST_NOVEDADES_STOCK.
[14/05/2026 | 15:58:50 ] [INFO] Request a enviar: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.business.soap.bridge.synthesis.com/">
                                       <soapenv:Header/>
                                       <soapenv:Body>
                                          <ser:execute>
                                             <service>stock</service>
                                             <request><![CDATA[
                                                <bridgeCoreRequest>
                                                    <operation>createOrUpdate</operation>
                                                    <params>
                                             <stocks type="list"><stock type="bean"><storeCode>1327</storeCode><locationCode>DEP1</locationCode><itemInventoryState>IISD</itemInventoryState><revenueCenter>RCD</revenueCenter><items type="list"><item type="bean"><itemCode>X202020AA</itemCode><stockUnits>153</stockUnits></item><item type="bean"><itemCode>X20203AA</itemCode><stockUnits>148</stockUnits></item><item type="bean"><itemCode>X31800399101AA</itemCode><stockUnits>126</stockUnits></item><item type="bean"><itemCode>X31800418101</itemCode><stockUnits>9</stockUnits></item><item type="bean"><itemCode>X31800399101AA</itemCode><stockUnits>126</stockUnits></item><item type="bean"><itemCode>X31800418101</itemCode><stockUnits>9</stockUnits></item><item type="bean"><itemCode>X202020AA</itemCode><stockUnits>153</stockUnits></item><item type="bean"><itemCode>X20203AA</itemCode><stockUnits>148</stockUnits></item></items></stock></stocks>
                                                    </params>
                                                </bridgeCoreRequest>
                                             ]]></request>
                                             <store>0</store>
                                          </ser:execute>
                                       </soapenv:Body>
                                    </soapenv:Envelope>
[14/05/2026 | 15:58:55 ] [INFO] No se importaron algunos registros
[14/05/2026 | 15:58:55 ] [INFO] Error en ítem código: X202020AA - Detalle: El item con codigo X202020AA no existe
[14/05/2026 | 15:58:55 ] [INFO] Error en ítem código: X20203AA - Detalle: El item con codigo X20203AA no existe
[14/05/2026 | 15:58:55 ] [INFO] Error en ítem código: X31800399101AA - Detalle: El item con codigo X31800399101AA no existe
